# MetallicpaintBaseHighlightspread Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MetallicPaint..::..MetallicpaintBaseHighlightspread Property
MetallicPaint Class See Also
---
The property labeled "Highlight Spread" from the "MetallicPaint" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MetallicpaintBaseHighlightspread { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetallicpaintBaseHighlightspread As String
	Get
```

Visual C++
---
```text
public:
static property String^ MetallicpaintBaseHighlightspread {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".
# See Also
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace